; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v4 - type_1 ?v6 - type_2)
 	      (pred_1 ?v8 - object ?v6 - type_2)
	      (pred_3 ?v4 - type_1 ?v5 - type_3)
	      (pred_2 ?v4 - type_1 ?v8 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v4 - type_1 ?v7 ?v3 - type_2)
       :precondition (and  (pred_4 ?v4 ?v7))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_1 ?v1 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v2) (pred_4 ?v4 ?v2) (pred_3 ?v4 ?v5))
       :effect (and (pred_2 ?v4 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_3 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_1 ?v1 - object ?v2 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v1 ?v5) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_3 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v1 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_02 obj_03 - type_3
obj_07 obj_04 obj_05 - type_2
obj_01 obj_08 obj_09 - object)
(:init
(pred_4 obj_06 obj_07)
(pred_3 obj_06 obj_02)
(pred_3 obj_06 obj_03)
(pred_1 obj_01 obj_05)
(pred_1 obj_08 obj_07)
(pred_1 obj_09 obj_07)
)
(:goal
(and
(pred_1 obj_01 obj_05)
(pred_1 obj_08 obj_05)
(pred_1 obj_09 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_02))))
)
)

; plan
1. (op_1 obj_06 obj_09 obj_07 obj_03)
   deleted: (pred_1 obj_09 obj_07) (pred_3 obj_06 obj_03)
   added: (pred_2 obj_06 obj_09 obj_03)
   goals met: 1 of 3
2. (op_2 obj_06 obj_07 obj_05)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
3. (op_3 obj_06 obj_09 obj_05 obj_03)
   deleted: (pred_2 obj_06 obj_09 obj_03)
   added: (pred_1 obj_09 obj_05) (pred_3 obj_06 obj_03)
   goals met: 2 of 3
4. (op_2 obj_06 obj_05 obj_07)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_07)
   goals met: 2 of 3
5. (op_1 obj_06 obj_08 obj_07 obj_03)
   deleted: (pred_1 obj_08 obj_07) (pred_3 obj_06 obj_03)
   added: (pred_2 obj_06 obj_08 obj_03)
   goals met: 2 of 3
6. (op_2 obj_06 obj_07 obj_05)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_05)
   goals met: 2 of 3
7. (op_3 obj_06 obj_08 obj_05 obj_03)
   deleted: (pred_2 obj_06 obj_08 obj_03)
   added: (pred_1 obj_08 obj_05) (pred_3 obj_06 obj_03)
   goals met: 3 of 3
